Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_opa.h
  uint32_t VoltageBuildIn;             /*!< Specifies the Voltage Build In   
                                            This parameter must be a value of @ref OPA_VoltageBuildIn */


} OPA_InitTypeDef;

/**
  * @brief  HAL State structures definition
  */

typedef enum
{
  HAL_OPA_STATE_RESET               = 0x00000000UL, /*!< OPA is not yet Initialized          */

  HAL_OPA_STATE_READY               = 0x00000001UL, /*!< OPA is initialized and ready for use */
  HAL_OPA_STATE_CALIBBUSY           = 0x00000002UL, /*!< OPA is enabled in auto calibration mode */

  HAL_OPA_STATE_BUSY                = 0x00000004UL, /*!< OPA is enabled and running in normal mode */
  HAL_OPA_STATE_BUSYLOCKED          = 0x00000005UL, /*!< OPA control register is locked
                                                         only system reset allows reconfiguring the opa. */

} HAL_OPA_StateTypeDef;

/**
  * @brief OPA Handle Structure definition
  */
#if (USE_HAL_OPA_REGISTER_CALLBACKS == 1)
typedef struct __OPA_HandleTypeDef
#else
typedef struct
#endif
{
  OPA_TypeDef       *Instance;                    /*!< OPA instance's registers base address   */
  OPA_InitTypeDef   Init;                         /*!< OPA required parameters */
  HAL_StatusTypeDef Status;                         /*!< OPA peripheral status   */
  HAL_LockTypeDef   Lock;                           /*!< Locking object          */
  __IO HAL_OPA_StateTypeDef  State;               /*!< OPA communication state */

#if (USE_HAL_OPA_REGISTER_CALLBACKS == 1)
  void (* MspInitCallback)(struct __OPA_HandleTypeDef *hopa);
  void (* MspDeInitCallback)(struct __OPA_HandleTypeDef *hopa);
#endif /* USE_HAL_OPA_REGISTER_CALLBACKS */

} OPA_HandleTypeDef;

#if (USE_HAL_OPA_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL OPA Callback ID enumeration definition
  */
typedef enum
{
  HAL_OPA_MSPINIT_CB_ID                     = 0x01UL,  /*!< OPA MspInit Callback ID           */
  HAL_OPA_MSPDEINIT_CB_ID                   = 0x02UL,  /*!< OPA MspDeInit Callback ID         */
  HAL_OPA_ALL_CB_ID                          = 0x03UL   /*!< OPA All ID                        */
} HAL_OPA_CallbackIDTypeDef;

/**
  * @brief  HAL OPA Callback pointer definition
  */
typedef void (*pOPA_CallbackTypeDef)(OPA_HandleTypeDef *hopa);
#endif /* USE_HAL_OPA_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup OPA_Exported_Constants OPA Exported Constants
  * @{
  */
/** @defgroup OPA_Mode OPA Mode
  * @{
  */
#define OPA_STANDALONE_MODE            (0x00000000UL)        /*!< standalone mode */
#define OPA_CURRENTSAMPLE_MODE         (0x00000001UL)        /*!< current sample mode */
#define OPA_PGA_MODE                   OPA_CSR_VM_SEL_1      /*!< PGA mode */
/* #define OPA_FOLLOWER_MODE              OPA_CSR_VM_SEL    */    /*!< follower mode */
/**
  * @}
  */

/** @defgroup OPA_NonInvertingInput OPA Non Inverting Input
  * @{
  */
#define OPA_NONINVERTINGINPUT_IO0         (0x00000000UL)        /*!< Non inverting input connected to I/O VINP0
                                                                       (PA1  for OPA1, PA7  for OPA2, PB0  for OPA3) */

#define OPA_NONINVERTINGINPUT_IO1         OPA_CSR_VP_SEL_0     /*!< Non inverting input connected to I/O VINP1
                                                                       (PA3  for OPA1, PB14 for OPA2, PB13 for OPA3) */

#define OPA_NONINVERTINGINPUT_IO2         OPA_CSR_VP_SEL_1     /*!< Non inverting input connected to I/O VINP2
                                                                       (PA7  for OPA1, PB0  for OPA2, PA1  for OPA3) */
 
#define OPA_NONINVERTINGINPUT_IO3         OPA_CSR_VP_SEL       /*!< Non inverting input connected to I/O VINP3
                                                                       (PD14 for OPA2) */
#define OPA_NONINVERTINGINPUT_DAC         OPA_CSR_VP_SEL       /*!< Non inverting input connected internally to DAC channel
                                                                       (DAC1_CH1 for OPA1, DAC2_CH1  for OPA3)*/
/**
  * @}
  */

/** @defgroup OPA_InvertingInput OPA Inverting Input
  * @{
  */
#define OPA_INVERTINGINPUT_IO0       (0x00000000UL)              /*!< Inverting input connected to I/O VINM0
                                                                       (PA3  for OPA1, PA5  for OPA2, PB2  for OPA3) */
                                                                    
#define OPA_INVERTINGINPUT_IO1       OPA_CSR_VM_SEL_0           /*!< Inverting input connected to I/0 VINM1
                                                                       (PC5  for OPA1, PC5  for OPA2, PB10 for OPA3) */                                     
/**
  * @}
  */

/** @defgroup OPA_VoltageBuildIn OPA Voltage Build In
  * @{
  */
#define OPA_VOLTAGEBUILDIN_VCC_DIV2       (OPA_CSR_OPA_VBIAS_0 )              
                                                                    
#define OPA_VOLTAGEBUILDIN_VCC_DIV5       (OPA_CSR_OPA_VBIAS_1 )     

#define OPA_VOLTAGEBUILDIN_DISABLE        (0x00000000)    
/**
  * @}
  */

/** @defgroup OPA_TimerControlledMuxmode OPA Timer Controlled Mux mode
  * @note The switch can be controlled either by a single timer or a combination of them,
  *       in this case application has to 'ORed' the values below
  *       ex OPA_TIMERCONTROLLEDMUXMODE_TIM1_CH6 
  * @{
  */
#define OPA_TIMERCONTROLLEDMUXMODE_DISABLE    (0x00000000UL)      /*!< Timer controlled Mux mode disabled */
#define OPA_TIMERCONTROLLEDMUXMODE_TIM1_CH6   OPA_TCMR_T1CM_EN    /*!< Timer controlled Mux mode enabled using TIM1 OC6 */
#define OPA_TIMERCONTROLLEDMUXMODE_TIM8_CH6   OPA_TCMR_T8CM_EN    /*!< Timer controlled Mux mode enabled using TIM8 OC6 */
/**
  * @}
  */

/** @defgroup OPA_NonInvertingInputSecondary OPA Non Inverting Input Secondary
  * @{
  */
#define OPA_SEC_NONINVERTINGINPUT_IO0         (0x00000000UL)       /*!< Secondary non inverting input connected to I/O VINP0
                                                                           (PA1  for OPA1, PA7  for OPA2, PB0  for OPA3)*/

#define OPA_SEC_NONINVERTINGINPUT_IO1         OPA_TCMR_VPS_SEL_0   /*!< Secondary non inverting input connected to I/O VINP1
                                                                           (PA3  for OPA1, PB14 for OPA2, PB13 for OPA3) */

#define OPA_SEC_NONINVERTINGINPUT_IO2         OPA_TCMR_VPS_SEL_1   /*!< Secondary non inverting input connected to I/O VINP2
                                                                           (PA7  for OPA1, PB0  for OPA2, PA1  for OPA3) */

#define OPA_SEC_NONINVERTINGINPUT_IO3         OPA_TCMR_VPS_SEL     /*!< Secondary non inverting input connected to I/O VINP3
                                                                           (PD14 for OPA2) */
#define OPA_SEC_NONINVERTINGINPUT_DAC         OPA_TCMR_VPS_SEL     /*!< Secondary non inverting input connected internally to DAC channel
                                                                           (DAC1_CH1 for OPA1, DAC2_CH1  for OPA3) */
/**
  * @}
  */

/** @defgroup OPA_InvertingInputSecondary OPA Inverting Input Secondary
  * @{
  */
#define OPA_SEC_INVERTINGINPUT_IO0       (0x00000000UL)              /*!< OPA secondary mode is standalone mode - Only applicable if @ref OPA_STANDALONE_MODE
                                                                            has been configured by call to @ref HAL_OPA_Init().
                                                                            Secondary inverting input connected to I/O VINM0
                                                                            (PA3  for OPA1, PA5  for OPA2, PB2  for OPA3) */

#define OPA_SEC_INVERTINGINPUT_IO1       OPA_TCMR_VMS_SEL           /*!< OPA secondary mode is standalone mode - Only applicable if @ref OPA_STANDALONE_MODE
                                                                            has been configured by call to @ref HAL_OPA_Init().
                                                                            Secondary inverting input connected to I/0 VINM1
                                                                            (PC5  for OPA1, PC5  for OPA2, PB10 for OPA3) */

#define OPA_SEC_INVERTINGINPUT_PGA       (0x00000000UL)              /*!< OPA secondary mode is PGA mode - Only applicable if configured mode through call to @ref HAL_OPA_Init()
                                                                           is @ref OPA_PGA_MODE or @ref OPA_FOLLOWER_MODE.
                                                                           OPA secondary inverting input is:
                                                                             - Not connected if configured mode is @ref OPA_FOLLOWER_MODE
                                                                             - Not connected if configured mode is @ref OPA_PGA_MODE and PGA connect mode is @ref OPA_PGA_CONNECT_INVERTINGINPUT_NO
                                                                             - Connected to VINM0 and possibly VINM1 if any of the other modes as been configured
                                                                           (see @ref OPA_PgaConnect description for more details on PGA connection modes) */
/* #define OPA_SEC_INVERTINGINPUT_FOLLOWER  OPA_TCMR_VMS_SEL     */      /*!< OPA secondary mode is Follower mode - Only applicable if configured mode through call to @ref HAL_OPA_Init()
                                                                           is @ref OPA_PGA_MODE or @ref OPA_FOLLOWER_MODE.
                                                                           OPA secondary inverting input is not connected. */
/**
  * @}
  */

/** @defgroup OPA_PgaConnect OPA Pga Connect
  * @{
  */
#define OPA_PGA_CONNECT_INVERTINGINPUT_NO               (0x00000000UL)                            /*!< In PGA mode, the inverting input is not connected */
#define OPA_PGA_CONNECT_INVERTINGINPUT_IO0              OPA_CSR_PGA_GAIN_4                        /*!< In PGA mode, the inverting input is connected to VINM0 for filtering */
#define OPA_PGA_CONNECT_INVERTINGINPUT_IO0_BIAS         OPA_CSR_PGA_GAIN_3                        /*!< In PGA mode, the inverting input is connected to VINM0
                                                                                                      - Input signal on VINM0, bias on VINPx: negative gain
                                                                                                      - Bias on VINM0, input signal on VINPx: positive gain */
#define OPA_PGA_CONNECT_INVERTINGINPUT_IO0_IO1_BIAS     (OPA_CSR_PGA_GAIN_4|OPA_CSR_PGA_GAIN_3)   /*!< In PGA mode, the inverting input is connected to VINM0
                                                                                                      - Input signal on VINM0, bias on VINPx: negative gain
                                                                                                      - Bias on VINM0, input signal on VINPx: positive gain
                                                                                                      And VINM1 is connected too for filtering */
/**
  * @}
  */

