Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_opa.h
/** @defgroup OPA_PgaGain OPA Pga Gain
  * @note Gain sign:
  *         - is positive if the @ref OPA_PgaConnect configuration is
  *           @ref OPA_PGA_CONNECT_INVERTINGINPUT_NO or OPA_PGA_CONNECT_INVERTINGINPUT_IO0
  *         - may be positive or negative if the @ref OPA_PgaConnect configuration is
  *           @ref OPA_PGA_CONNECT_INVERTINGINPUT_IO0_BIAS or OPA_PGA_CONNECT_INVERTINGINPUT_IO0_IO1_BIAS
  *       see @ref OPA_PgaConnect for more details
  * @{
  */
#define OPA_PGA_GAIN_2_OR_MINUS_1          (0x00000000UL)                                                      /*!< PGA gain could be 2  or -1  */
#define OPA_PGA_GAIN_4_OR_MINUS_3          (                                          OPA_CSR_PGA_GAIN_0)      /*!< PGA gain could be 4  or -3  */
#define OPA_PGA_GAIN_8_OR_MINUS_7          (                     OPA_CSR_PGA_GAIN_1                     )      /*!< PGA gain could be 8  or -7  */
#define OPA_PGA_GAIN_16_OR_MINUS_15        (                     OPA_CSR_PGA_GAIN_1 | OPA_CSR_PGA_GAIN_0)      /*!< PGA gain could be 16 or -15 */
#define OPA_PGA_GAIN_32_OR_MINUS_31        (OPA_CSR_PGA_GAIN_2                                          )      /*!< PGA gain could be 32 or -31 */
/* #define OPA_PGA_GAIN_64_OR_MINUS_63        (OPA_CSR_PGA_GAIN_2 |                      OPA_CSR_PGA_GAIN_0) */   /*!< PGA gain could be 64 or -63 */
/**
  * @}
  */

/** @defgroup OPA_PowerMode OPA PowerMode
  * @{
  */
#define OPA_POWERMODE_NORMALSPEED   (0x00000000UL)         /*!< Output in normal mode */
#define OPA_POWERMODE_HIGHSPEED     OPA_CSR_OPAHSM         /*!< Output in highspeed mode */
/**
  * @}
  */

/**
  * @}
  */



/* Private constants ---------------------------------------------------------*/
/** @defgroup OPA_Private_Constants OPA Private Constants
  * @brief   OPA Private constants and defines
  * @{
  */
/** @defgroup OPA_Input OPA Input
  * @{
  */
#define OPA_INPUT_INVERTING                 ( 24UL) /*!< Inverting input */
#define OPA_INPUT_NONINVERTING              ( 19UL) /*!< Non inverting input */

#define IS_OPA_INPUT(INPUT) (((INPUT) == OPA_INPUT_INVERTING) || \
                               ((INPUT) == OPA_INPUT_NONINVERTING))
/**
  * @}
  */

/**
  * @}
  */


/* Private macro -------------------------------------------------------------*/

/** @defgroup OPA_Private_Macros OPA Private Macros
  * @{
  */

#if defined(OPA_FOLLOWER_MODE)
#define IS_OPA_FUNCTIONAL_NORMALMODE(INPUT) (((INPUT) == OPA_STANDALONE_MODE) || \
                                               ((INPUT) == OPA_PGA_MODE) || \
                                               ((INPUT) == OPA_CURRENTSAMPLE_MODE) || \
                                               ((INPUT) == OPA_FOLLOWER_MODE))
#else
#define IS_OPA_FUNCTIONAL_NORMALMODE(INPUT) (((INPUT) == OPA_STANDALONE_MODE) || \
                                               ((INPUT) == OPA_PGA_MODE) || \
                                               ((INPUT) == OPA_CURRENTSAMPLE_MODE))
#endif

#define IS_OPA_NONINVERTING_INPUT(INPUT) (((INPUT) == OPA_NONINVERTINGINPUT_IO0) || \
                                            ((INPUT) == OPA_NONINVERTINGINPUT_IO1) || \
                                            ((INPUT) == OPA_NONINVERTINGINPUT_IO2) || \
                                            ((INPUT) == OPA_NONINVERTINGINPUT_IO3) || \
                                            ((INPUT) == OPA_NONINVERTINGINPUT_DAC))

#define IS_OPA_INVERTING_INPUT(INPUT) (((INPUT) == OPA_INVERTINGINPUT_IO0) || \
                                         ((INPUT) == OPA_INVERTINGINPUT_IO1))


#define IS_OPA_TIMERCONTROLLED_MUXMODE(MUXMODE)  \
  ((MUXMODE) <= (OPA_TIMERCONTROLLEDMUXMODE_TIM1_CH6 |    \
                 OPA_TIMERCONTROLLEDMUXMODE_TIM8_CH6))

#define IS_OPA_SEC_NONINVERTING_INPUT(INPUT) (((INPUT) == OPA_SEC_NONINVERTINGINPUT_IO0) || \
                                                ((INPUT) == OPA_SEC_NONINVERTINGINPUT_IO1) || \
                                                ((INPUT) == OPA_SEC_NONINVERTINGINPUT_IO2) || \
                                                ((INPUT) == OPA_SEC_NONINVERTINGINPUT_IO3) || \
                                                ((INPUT) == OPA_SEC_NONINVERTINGINPUT_DAC))

#if defined(OPA_FOLLOWER_MODE)
#define IS_OPA_SEC_INVERTING_INPUT(INPUT) (((INPUT) == OPA_SEC_INVERTINGINPUT_IO0) || \
                                             ((INPUT) == OPA_SEC_INVERTINGINPUT_IO1) || \
                                             ((INPUT) == OPA_SEC_INVERTINGINPUT_PGA) || \
                                             ((INPUT) == OPA_SEC_INVERTINGINPUT_FOLLOWER))
#else
#define IS_OPA_SEC_INVERTING_INPUT(INPUT) (((INPUT) == OPA_SEC_INVERTINGINPUT_IO0) || \
                                             ((INPUT) == OPA_SEC_INVERTINGINPUT_IO1) || \
                                             ((INPUT) == OPA_SEC_INVERTINGINPUT_PGA))
#endif

#define IS_OPA_PGACONNECT(CONNECT) (((CONNECT) == OPA_PGA_CONNECT_INVERTINGINPUT_NO)            || \
                                      ((CONNECT) == OPA_PGA_CONNECT_INVERTINGINPUT_IO0)           || \
                                      ((CONNECT) == OPA_PGA_CONNECT_INVERTINGINPUT_IO0_BIAS)      || \
                                      ((CONNECT) == OPA_PGA_CONNECT_INVERTINGINPUT_IO0_IO1_BIAS))

#ifdef OPA_PGA_GAIN_64_OR_MINUS_63
#define IS_OPA_PGA_GAIN(GAIN) (((GAIN) == OPA_PGA_GAIN_2_OR_MINUS_1)   || \
                                 ((GAIN) == OPA_PGA_GAIN_4_OR_MINUS_3)   || \
                                 ((GAIN) == OPA_PGA_GAIN_8_OR_MINUS_7)   || \
                                 ((GAIN) == OPA_PGA_GAIN_16_OR_MINUS_15) || \
                                 ((GAIN) == OPA_PGA_GAIN_32_OR_MINUS_31) || \
                                 ((GAIN) == OPA_PGA_GAIN_64_OR_MINUS_63))
#else
#define IS_OPA_PGA_GAIN(GAIN) (((GAIN) == OPA_PGA_GAIN_2_OR_MINUS_1)   || \
                                 ((GAIN) == OPA_PGA_GAIN_4_OR_MINUS_3)   || \
                                 ((GAIN) == OPA_PGA_GAIN_8_OR_MINUS_7)   || \
                                 ((GAIN) == OPA_PGA_GAIN_16_OR_MINUS_15) || \
                                 ((GAIN) == OPA_PGA_GAIN_32_OR_MINUS_31))
#endif

#define IS_OPA_POWERMODE(POWERMODE) (((POWERMODE) == OPA_POWERMODE_NORMALSPEED) || \
                                       ((POWERMODE) == OPA_POWERMODE_HIGHSPEED) )


/**
  * @}
  */


/* Exported macros -----------------------------------------------------------*/
/** @defgroup OPA_Exported_Macros OPA Exported Macros
  * @{
  */

/** @brief Reset OPA handle state
  * @param  __HANDLE__ OPA handle.
  * @retval None
  */
#define __HAL_OPA_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_OPA_STATE_RESET)

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup OPA_Exported_Functions OPA Exported Functions
  * @{
  */

/** @defgroup OPA_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

/* Initialization/de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_OPA_Init(OPA_HandleTypeDef *hopa);
HAL_StatusTypeDef HAL_OPA_DeInit(OPA_HandleTypeDef *hopa);
void HAL_OPA_MspInit(OPA_HandleTypeDef *hopa);
void HAL_OPA_MspDeInit(OPA_HandleTypeDef *hopa);
/**
  * @}
  */


/** @defgroup OPA_Exported_Functions_Group2 Input and Output operation functions
  * @{
  */

/* I/O operation functions  *****************************************************/
HAL_StatusTypeDef HAL_OPA_Start(OPA_HandleTypeDef *hopa);
HAL_StatusTypeDef HAL_OPA_Stop(OPA_HandleTypeDef *hopa);


/**
  * @}
  */

/** @defgroup OPA_Exported_Functions_Group3 Peripheral Control functions
  * @{
  */

/* Peripheral Control functions  ************************************************/
#if (USE_HAL_OPA_REGISTER_CALLBACKS == 1)
/* OPA callback registering/unregistering */
HAL_StatusTypeDef HAL_OPA_RegisterCallback(OPA_HandleTypeDef *hopa, HAL_OPA_CallbackIDTypeDef CallbackId,
                                             pOPA_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_OPA_UnRegisterCallback(OPA_HandleTypeDef *hopa, HAL_OPA_CallbackIDTypeDef CallbackId);
#endif /* USE_HAL_OPA_REGISTER_CALLBACKS */

HAL_StatusTypeDef HAL_OPA_Lock(OPA_HandleTypeDef *hopa);
HAL_StatusTypeDef HAL_OPA_LockTimerMux(OPA_HandleTypeDef *hopa);

/**
  * @}
  */

/** @defgroup OPA_Exported_Functions_Group4 Peripheral State functions
  * @{
  */

/* Peripheral State functions  **************************************************/
HAL_OPA_StateTypeDef HAL_OPA_GetState(OPA_HandleTypeDef *hopa);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
}
#endif

#endif /* PY32E407_HAL_OPA_H */

